## Plan Result (stg_mgmt)




<pre><code>Plan: 24 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.data_mgmt_zone.azurerm_key_vault_access_policy.purview
  * module.data_mgmt_zone.azurerm_private_endpoint.kv_endpoint
  * module.data_mgmt_zone.azurerm_private_endpoint.purview_endpoint[&#34;account&#34;]
  * module.data_mgmt_zone.azurerm_private_endpoint.purview_endpoint[&#34;portal&#34;]
  * module.data_mgmt_zone.azurerm_private_endpoint.synapse_private_link_hub_endpoint
  * module.data_mgmt_zone.azurerm_resource_group.new[0]
  * module.data_mgmt_zone.azurerm_role_assignment.name[0]
  * module.data_mgmt_zone.azurerm_synapse_private_link_hub.this
  * module.data_mgmt_zone.azurerm_user_assigned_identity.this
  * module.data_mgmt_zone.module.key_vault.azurerm_key_vault.kv
  * module.data_mgmt_zone.module.key_vault.azurerm_key_vault_access_policy.creator_access_policy
  * module.data_mgmt_zone.module.key_vault.azurerm_key_vault_access_policy.developer[0]
  * module.data_mgmt_zone.module.key_vault.azurerm_key_vault_access_policy.product_team_access_policy
  * module.data_mgmt_zone.module.key_vault.azurerm_monitor_diagnostic_setting.kv-ds
  * module.data_mgmt_zone.module.networking.azurerm_network_security_group.this[&#34;nsg&#34;]
  * module.data_mgmt_zone.module.networking.azurerm_network_security_rule.deny_inbound[&#34;nsg&#34;]
  * module.data_mgmt_zone.module.networking.azurerm_route.this[&#34;rt-default&#34;]
  * module.data_mgmt_zone.module.networking.azurerm_route_table.this[&#34;rt&#34;]
  * module.data_mgmt_zone.module.networking.azurerm_subnet.this[&#34;vnet-services&#34;]
  * module.data_mgmt_zone.module.networking.azurerm_subnet_network_security_group_association.this[&#34;nsg-vnet-services&#34;]
  * module.data_mgmt_zone.module.networking.azurerm_subnet_route_table_association.this[&#34;rt-vnet-services&#34;]
  * module.data_mgmt_zone.module.networking.azurerm_virtual_network.this[&#34;vnet&#34;]
  * module.data_mgmt_zone.module.vnet_peer_hub.azurerm_virtual_network_peering.initiator_to_target
  * module.data_mgmt_zone.module.vnet_peer_hub.azurerm_virtual_network_peering.target_to_initiator




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.data_mgmt_zone.azurerm_key_vault_access_policy.purview will be created
  + resource "azurerm_key_vault_access_policy" "purview" {
      + id                 = (known after apply)
      + key_vault_id       = (known after apply)
      + object_id          = "b92d5586-c076-4598-bccf-4ba081889621"
      + secret_permissions = [
          + "Get",
          + "List",
          + "Set",
          + "Delete",
          + "Recover",
          + "Backup",
          + "Restore",
          + "Purge",
        ]
      + tenant_id          = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.data_mgmt_zone.azurerm_private_endpoint.kv_endpoint will be created
  + resource "azurerm_private_endpoint" "kv_endpoint" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "uksouth"
      + name                     = "ingest-mgmt-kv-endpoint-stg"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "ingest-mgmt-rg-stg"
      + subnet_id                = (known after apply)
      + tags                     = {
          + "application"  = "dlrm-data-ingest"
          + "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
          + "businessArea" = "cross-cutting"
          + "criticality"  = "High"
          + "environment"  = "staging"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "endpoint-dnszonegroup"
          + private_dns_zone_ids = [
              + "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.vaultcore.azure.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "ingest-mgmt-kv-endpoint-connection-stg"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "vault",
            ]
        }
    }

  # module.data_mgmt_zone.azurerm_private_endpoint.purview_endpoint["account"] will be created
  + resource "azurerm_private_endpoint" "purview_endpoint" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "uksouth"
      + name                     = "ingest-mgmt-purview-endpoint-account-stg"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "ingest-mgmt-rg-stg"
      + subnet_id                = (known after apply)
      + tags                     = {
          + "application"  = "dlrm-data-ingest"
          + "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
          + "businessArea" = "cross-cutting"
          + "criticality"  = "High"
          + "environment"  = "staging"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "endpoint-dnszonegroup"
          + private_dns_zone_ids = [
              + "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.purview.azure.com",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "ingest-mgmt-purview-endpoint-account-connection-stg"
          + private_connection_resource_id = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/mi-sbox-rg/providers/Microsoft.Purview/accounts/mi-purview-sbox"
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "account",
            ]
        }
    }

  # module.data_mgmt_zone.azurerm_private_endpoint.purview_endpoint["portal"] will be created
  + resource "azurerm_private_endpoint" "purview_endpoint" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "uksouth"
      + name                     = "ingest-mgmt-purview-endpoint-portal-stg"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "ingest-mgmt-rg-stg"
      + subnet_id                = (known after apply)
      + tags                     = {
          + "application"  = "dlrm-data-ingest"
          + "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
          + "businessArea" = "cross-cutting"
          + "criticality"  = "High"
          + "environment"  = "staging"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "endpoint-dnszonegroup"
          + private_dns_zone_ids = [
              + "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.purview.azure.com",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "ingest-mgmt-purview-endpoint-portal-connection-stg"
          + private_connection_resource_id = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/mi-sbox-rg/providers/Microsoft.Purview/accounts/mi-purview-sbox"
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "portal",
            ]
        }
    }

  # module.data_mgmt_zone.azurerm_private_endpoint.synapse_private_link_hub_endpoint will be created
  + resource "azurerm_private_endpoint" "synapse_private_link_hub_endpoint" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "uksouth"
      + name                     = "ingest-mgmt-synapse-endpoint-stg"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "ingest-mgmt-rg-stg"
      + subnet_id                = (known after apply)
      + tags                     = {
          + "application"  = "dlrm-data-ingest"
          + "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
          + "businessArea" = "cross-cutting"
          + "criticality"  = "High"
          + "environment"  = "staging"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "endpoint-dnszonegroup"
          + private_dns_zone_ids = [
              + "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.azuresynapse.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "ingest-mgmt-synapse-endpoint-connection-stg"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "web",
            ]
        }
    }

  # module.data_mgmt_zone.azurerm_resource_group.new[0] will be created
  + resource "azurerm_resource_group" "new" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "ingest-mgmt-rg-stg"
      + tags     = {
          + "application"  = "dlrm-data-ingest"
          + "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
          + "businessArea" = "cross-cutting"
          + "criticality"  = "High"
          + "environment"  = "staging"
        }
    }

  # module.data_mgmt_zone.azurerm_role_assignment.name[0] will be created
  + resource "azurerm_role_assignment" "name" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Owner"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.data_mgmt_zone.azurerm_synapse_private_link_hub.this will be created
  + resource "azurerm_synapse_private_link_hub" "this" {
      + id                  = (known after apply)
      + location            = "uksouth"
      + name                = "ingestmgmtsynapsehubstg"
      + resource_group_name = "ingest-mgmt-rg-stg"
      + tags                = {
          + "application"  = "dlrm-data-ingest"
          + "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
          + "businessArea" = "cross-cutting"
          + "criticality"  = "High"
          + "environment"  = "staging"
        }
    }

  # module.data_mgmt_zone.azurerm_user_assigned_identity.this will be created
  + resource "azurerm_user_assigned_identity" "this" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = "uksouth"
      + name                = "ingest-mgmt-identity-stg"
      + principal_id        = (known after apply)
      + resource_group_name = "ingest-mgmt-rg-stg"
      + tags                = {
          + "application"  = "dlrm-data-ingest"
          + "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
          + "businessArea" = "cross-cutting"
          + "criticality"  = "High"
          + "environment"  = "staging"
        }
      + tenant_id           = (known after apply)
    }

  # module.data_mgmt_zone.module.key_vault.azurerm_key_vault.kv will be created
  + resource "azurerm_key_vault" "kv" {
      + access_policy                   = (known after apply)
      + enabled_for_deployment          = true
      + enabled_for_disk_encryption     = true
      + enabled_for_template_deployment = true
      + id                              = (known after apply)
      + location                        = "uksouth"
      + name                            = "ingest-mgmt-kv-stg"
      + public_network_access_enabled   = true
      + purge_protection_enabled        = true
      + resource_group_name             = "ingest-mgmt-rg-stg"
      + sku_name                        = "standard"
      + soft_delete_retention_days      = 90
      + tags                            = {
          + "application"  = "dlrm-data-ingest"
          + "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
          + "businessArea" = "cross-cutting"
          + "criticality"  = "High"
          + "environment"  = "staging"
        }
      + tenant_id                       = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
      + vault_uri                       = (known after apply)

      + network_acls {
          + bypass         = "AzureServices"
          + default_action = "Allow"
        }
    }

  # module.data_mgmt_zone.module.key_vault.azurerm_key_vault_access_policy.creator_access_policy will be created
  + resource "azurerm_key_vault_access_policy" "creator_access_policy" {
      + certificate_permissions = [
          + "Create",
          + "Delete",
          + "DeleteIssuers",
          + "Get",
          + "GetIssuers",
          + "Import",
          + "List",
          + "ListIssuers",
          + "SetIssuers",
          + "Update",
          + "ManageContacts",
          + "ManageIssuers",
        ]
      + id                      = (known after apply)
      + key_permissions         = [
          + "Create",
          + "List",
          + "Get",
          + "Delete",
          + "Update",
          + "Import",
          + "Backup",
          + "Restore",
          + "Decrypt",
          + "Encrypt",
          + "UnwrapKey",
          + "WrapKey",
          + "Sign",
          + "Verify",
          + "GetRotationPolicy",
        ]
      + key_vault_id            = (known after apply)
      + object_id               = "881cece9-ee47-4c97-ab61-39bbe100893e"
      + secret_permissions      = [
          + "Set",
          + "List",
          + "Get",
          + "Delete",
          + "Recover",
          + "Purge",
        ]
      + tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.data_mgmt_zone.module.key_vault.azurerm_key_vault_access_policy.developer[0] will be created
  + resource "azurerm_key_vault_access_policy" "developer" {
      + certificate_permissions = [
          + "Get",
          + "List",
        ]
      + id                      = (known after apply)
      + key_permissions         = [
          + "Get",
          + "List",
        ]
      + key_vault_id            = (known after apply)
      + object_id               = "b2a1773c-a5ae-48b5-b5fa-95b0e05eee05"
      + secret_permissions      = [
          + "Get",
          + "List",
        ]
      + tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.data_mgmt_zone.module.key_vault.azurerm_key_vault_access_policy.product_team_access_policy will be created
  + resource "azurerm_key_vault_access_policy" "product_team_access_policy" {
      + certificate_permissions = [
          + "List",
          + "Update",
          + "Create",
          + "Import",
          + "Delete",
          + "ManageContacts",
          + "ManageIssuers",
          + "GetIssuers",
          + "ListIssuers",
          + "SetIssuers",
          + "DeleteIssuers",
          + "Recover",
        ]
      + id                      = (known after apply)
      + key_permissions         = [
          + "List",
          + "Update",
          + "Create",
          + "Import",
          + "Delete",
          + "Recover",
        ]
      + key_vault_id            = (known after apply)
      + object_id               = "4d0554dd-fe60-424a-be9c-36636826d927"
      + secret_permissions      = [
          + "List",
          + "Set",
          + "Delete",
          + "Recover",
        ]
      + tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.data_mgmt_zone.module.key_vault.azurerm_monitor_diagnostic_setting.kv-ds will be created
  + resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
      + id                             = (known after apply)
      + log_analytics_destination_type = (known after apply)
      + log_analytics_workspace_id     = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/oms-automation/providers/Microsoft.OperationalInsights/workspaces/hmcts-nonprod"
      + name                           = "ingest-mgmt-kv-stg"
      + target_resource_id             = (known after apply)

      + enabled_log {
          + category = "AuditEvent"
        }
    }

  # module.data_mgmt_zone.module.networking.azurerm_network_security_group.this["nsg"] will be created
  + resource "azurerm_network_security_group" "this" {
      + id                  = (known after apply)
      + location            = "uksouth"
      + name                = "ingest-mgmt-nsg-stg"
      + resource_group_name = "ingest-mgmt-rg-stg"
      + security_rule       = (known after apply)
      + tags                = {
          + "application"  = "dlrm-data-ingest"
          + "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
          + "businessArea" = "cross-cutting"
          + "criticality"  = "High"
          + "environment"  = "staging"
        }
    }

  # module.data_mgmt_zone.module.networking.azurerm_network_security_rule.deny_inbound["nsg"] will be created
  + resource "azurerm_network_security_rule" "deny_inbound" {
      + access                      = "Deny"
      + description                 = "Default DenyInbound rule"
      + destination_address_prefix  = "*"
      + destination_port_range      = "*"
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "DenyAllInbound"
      + network_security_group_name = "ingest-mgmt-nsg-stg"
      + priority                    = 4096
      + protocol                    = "*"
      + resource_group_name         = "ingest-mgmt-rg-stg"
      + source_address_prefix       = "*"
      + source_port_range           = "*"
    }

  # module.data_mgmt_zone.module.networking.azurerm_route.this["rt-default"] will be created
  + resource "azurerm_route" "this" {
      + address_prefix         = "0.0.0.0/0"
      + id                     = (known after apply)
      + name                   = "rt-default"
      + next_hop_in_ip_address = "10.11.72.36"
      + next_hop_type          = "VirtualAppliance"
      + resource_group_name    = "ingest-mgmt-rg-stg"
      + route_table_name       = "ingest-mgmt-rt-stg"
    }

  # module.data_mgmt_zone.module.networking.azurerm_route_table.this["rt"] will be created
  + resource "azurerm_route_table" "this" {
      + disable_bgp_route_propagation = false
      + id                            = (known after apply)
      + location                      = "uksouth"
      + name                          = "ingest-mgmt-rt-stg"
      + resource_group_name           = "ingest-mgmt-rg-stg"
      + route                         = (known after apply)
      + subnets                       = (known after apply)
      + tags                          = {
          + "application"  = "dlrm-data-ingest"
          + "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
          + "businessArea" = "cross-cutting"
          + "criticality"  = "High"
          + "environment"  = "staging"
        }
    }

  # module.data_mgmt_zone.module.networking.azurerm_subnet.this["vnet-services"] will be created
  + resource "azurerm_subnet" "this" {
      + address_prefixes                               = [
          + "10.147.1.0/24",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "ingest-mgmt-services-stg"
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "ingest-mgmt-rg-stg"
      + virtual_network_name                           = "ingest-mgmt-vnet-stg"
    }

  # module.data_mgmt_zone.module.networking.azurerm_subnet_network_security_group_association.this["nsg-vnet-services"] will be created
  + resource "azurerm_subnet_network_security_group_association" "this" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = (known after apply)
    }

  # module.data_mgmt_zone.module.networking.azurerm_subnet_route_table_association.this["rt-vnet-services"] will be created
  + resource "azurerm_subnet_route_table_association" "this" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.data_mgmt_zone.module.networking.azurerm_virtual_network.this["vnet"] will be created
  + resource "azurerm_virtual_network" "this" {
      + address_space       = [
          + "10.147.1.0/24",
        ]
      + dns_servers         = (known after apply)
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "uksouth"
      + name                = "ingest-mgmt-vnet-stg"
      + resource_group_name = "ingest-mgmt-rg-stg"
      + subnet              = (known after apply)
      + tags                = {
          + "application"  = "dlrm-data-ingest"
          + "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
          + "businessArea" = "cross-cutting"
          + "criticality"  = "High"
          + "environment"  = "staging"
        }
    }

  # module.data_mgmt_zone.module.vnet_peer_hub.azurerm_virtual_network_peering.initiator_to_target will be created
  + resource "azurerm_virtual_network_peering" "initiator_to_target" {
      + allow_forwarded_traffic      = true
      + allow_gateway_transit        = false
      + allow_virtual_network_access = true
      + id                           = (known after apply)
      + name                         = "ingest-mgmt-vnet-stg-to-hub"
      + remote_virtual_network_id    = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/virtualNetworks/hmcts-hub-nonprodi"
      + resource_group_name          = "ingest-mgmt-rg-stg"
      + use_remote_gateways          = false
      + virtual_network_name         = "ingest-mgmt-vnet-stg"
    }

  # module.data_mgmt_zone.module.vnet_peer_hub.azurerm_virtual_network_peering.target_to_initiator will be created
  + resource "azurerm_virtual_network_peering" "target_to_initiator" {
      + allow_forwarded_traffic      = true
      + allow_gateway_transit        = false
      + allow_virtual_network_access = true
      + id                           = (known after apply)
      + name                         = "hub-to-ingest-mgmt-vnet-stg"
      + remote_virtual_network_id    = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ingest-mgmt-rg-stg/providers/Microsoft.Network/virtualNetworks/ingest-mgmt-vnet-stg"
      + resource_group_name          = "hmcts-hub-nonprodi"
      + use_remote_gateways          = false
      + virtual_network_name         = "hmcts-hub-nonprodi"
    }

Plan: 24 to add, 0 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":6,"Program":"tfcmt","SHA1":"","Target":"stg_mgmt","Vars":{}} -->